# NumberingParameterId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchema..::..NumberingParameterId Property
NumberingSchema Class See Also
---
Id of the parameter that stores values of the numbers on enumerated elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId NumberingParameterId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberingParameterId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ NumberingParameterId {
	ElementId^ get ();
}
```

# Remarks
Values of numbers can be obtained by querying this parameter for the respective numbered element. The value is read-only and thus cannot be set; it is always computed based on the order of created elements and the matching policy within each numbering sequence.
_Note: Although the parameter cannot be changed directly, it can be modified indirectly (with restrictions) using theChangeNumber(String, Int32, Int32) method._
# See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace